wolfSSL/wolfip/src/port/stm32h753/main.c
    /* 3. Enable HSE with bypass (8MHz from ST-Link) */
    RCC_CR |= RCC_CR_HSEBYP;
    RCC_CR |= RCC_CR_HSEON;
    timeout = 100000;
    while (((RCC_CR & RCC_CR_HSERDY) == 0) && --timeout) {}
    if (timeout == 0) return -2;

    /* 4. Configure PLL1
     * Source: HSE (8MHz)
     * DIVM1 = 4  -> VCO input = 8/4 = 2MHz
     * DIVN1 = 400 -> VCO output = 2*400 = 800MHz
     * DIVP1 = 2  -> PLL1P = 800/2 = 400MHz (SYSCLK)
     * DIVQ1 = 4  -> PLL1Q = 800/4 = 200MHz
     * DIVR1 = 2  -> PLL1R = 800/2 = 400MHz
     */

    /* Disable PLL1 first */
    RCC_CR &= ~RCC_CR_PLL1ON;
    timeout = 100000;
    while ((RCC_CR & RCC_CR_PLL1RDY) && --timeout) {}

    /* PLL1 clock source = HSE, DIVM1 = 4 */
    RCC_PLLCKSELR = (4u << 4) |   /* DIVM1 = 4 */
                    (2u << 0);    /* PLLSRC = HSE */

    /* PLL1 configuration: wide VCO range, integer mode */
    RCC_PLLCFGR = (RCC_PLLCFGR & ~0x1FFu) |
                  (1u << 0) |     /* PLL1FRACEN = 0, then set DIVPEN etc */
                  (1u << 16) |    /* DIVP1EN */
                  (1u << 17) |    /* DIVQ1EN */
                  (1u << 18) |    /* DIVR1EN */
                  (2u << 2);      /* PLL1RGE = 2 (2-4MHz range) */
    RCC_PLLCFGR |= (1u << 1);     /* PLL1VCOSEL = 0 (wide VCO 192-836MHz) */
    RCC_PLLCFGR &= ~(1u << 1);    /* Clear for wide range */

    /* DIVN1=400, DIVP1=2, DIVQ1=4, DIVR1=2 (all -1 in register) */
    RCC_PLL1DIVR = ((2u - 1u) << 24) |   /* DIVR1 = 2 */
                   ((4u - 1u) << 16) |   /* DIVQ1 = 4 */
                   ((2u - 1u) << 9) |    /* DIVP1 = 2 */
                   ((400u - 1u) << 0);   /* DIVN1 = 400 */

    /* Clear fractional divider */
    RCC_PLL1FRACR = 0;

    /* 5. Enable PLL1 */
    RCC_CR |= RCC_CR_PLL1ON;
    timeout = 100000;
    while (((RCC_CR & RCC_CR_PLL1RDY) == 0) && --timeout) {}
    if (timeout == 0) return -3;

    /* 6. Configure Flash latency for 400MHz (4 wait states) */
    FLASH_ACR = FLASH_ACR_LATENCY_4WS | FLASH_ACR_WRHIGHFREQ_2;

    /* 7. Configure bus dividers
     * D1CPRE = /1 (SYSCLK = 400MHz)
     * HPRE = /2 (HCLK = 200MHz)  <- AHB clock for Ethernet
     * D1PPRE = /2 (APB3 = 100MHz)
     */
    RCC_D1CFGR = (0u << 8) |      /* D1CPRE = /1 */
                 (8u << 4) |      /* D1PPRE = /2 (8 = div2) */
                 (8u << 0);       /* HPRE = /2 */

    /* D2PPRE1 = /2, D2PPRE2 = /2 (APB1, APB2 = 100MHz) */
    RCC_D2CFGR = (4u << 8) |      /* D2PPRE2 = /2 */
                 (4u << 4);       /* D2PPRE1 = /2 */

    /* D3PPRE = /2 (APB4 = 100MHz) */
    RCC_D3CFGR = (4u << 4);       /* D3PPRE = /2 */

    /* 8. Switch system clock to PLL1 */
    RCC_CFGR = (RCC_CFGR & ~RCC_CFGR_SW_MASK) | RCC_CFGR_SW_PLL1;
    timeout = 100000;
    while (((RCC_CFGR & RCC_CFGR_SWS_MASK) != RCC_CFGR_SWS_PLL1) && --timeout) {}
    if (timeout == 0) return -4;

    return 0;  /* Success: SYSCLK=400MHz, HCLK=200MHz */
}

/* =========================================================================
 * LED Functions
 * ========================================================================= */

static void led_init(void)
{
    uint32_t moder;

    /* Enable GPIOB clock */
    RCC_AHB4ENR |= (1u << 1);
    delay(100);

    /* Set PB0, PB7, PB14 as outputs */
    moder = GPIO_MODER(GPIOB_BASE);
    moder &= ~((3u << (LED1_PIN * 2)) | (3u << (LED2_PIN * 2)) | (3u << (LED3_PIN * 2)));
    moder |= (1u << (LED1_PIN * 2)) | (1u << (LED2_PIN * 2)) | (1u << (LED3_PIN * 2));
    GPIO_MODER(GPIOB_BASE) = moder;
}

static void led_green_on(void)                     { GPIO_BSRR(GPIOB_BASE) = (1u << LED1_PIN); }
static void __attribute__((unused)) led_green_off(void) { GPIO_BSRR(GPIOB_BASE) = (1u << (LED1_PIN + 16)); }
static void led_blue_on(void)                      { GPIO_BSRR(GPIOB_BASE) = (1u << LED2_PIN); }
static void led_blue_off(void)                     { GPIO_BSRR(GPIOB_BASE) = (1u << (LED2_PIN + 16)); }
static void led_red_on(void)                       { GPIO_BSRR(GPIOB_BASE) = (1u << LED3_PIN); }
static void led_red_off(void)                      { GPIO_BSRR(GPIOB_BASE) = (1u << (LED3_PIN + 16)); }

static void led_toggle_green(void) { GPIO_ODR(GPIOB_BASE) ^= (1u << LED1_PIN); }

/* =========================================================================
 * UART Functions
 * ========================================================================= */

/* Early UART init using 64MHz HSI (before clock config) */
static void uart_init_early(void)
{
    uint32_t moder, afr;

    /* Enable GPIOD and USART3 clocks */
    RCC_AHB4ENR |= (1u << 3);   /* GPIOD */
    RCC_APB1LENR |= (1u << 18); /* USART3 */
    delay(100);

    /* Configure PD8 (TX) as AF7 (USART3_TX) */
    moder = GPIO_MODER(GPIOD_BASE);
    moder &= ~(3u << 16);  /* Clear PD8 mode */
    moder |= (2u << 16);   /* Alternate function */
    GPIO_MODER(GPIOD_BASE) = moder;

    GPIO_OSPEEDR(GPIOD_BASE) |= (3u << 16);  /* High speed for PD8 */

    /* AFRH: PD8 is bit 0-3 */
    afr = GPIO_AFRH(GPIOD_BASE);
    afr &= ~(0xFu << 0);
    afr |= (7u << 0);  /* AF7 = USART3 */
    GPIO_AFRH(GPIOD_BASE) = afr;

    /* Configure USART3: 115200 baud at 64MHz HSI */
    USART3_CR1 = 0;
    USART3_CR2 = 0;
    USART3_CR3 = 0;
    USART3_BRR = 64000000u / 115200u;  /* ~556 for 64MHz HSI */

    /* Enable transmitter and USART */
    USART3_CR1 = (1u << 3);  /* TE */
    delay(10);
    USART3_CR1 |= (1u << 0); /* UE */
    delay(100);
}

/* Reconfigure UART for 100MHz APB1 (after clock config) */
static void uart_reconfigure(void)
{
    /* Disable USART first */
    USART3_CR1 &= ~(1u << 0);
    delay(10);

    /* Reconfigure BRR for 100MHz APB1 */
    USART3_BRR = 100000000u / 115200u;  /* ~868 for 100MHz APB1 */

    /* Re-enable */
    USART3_CR1 |= (1u << 0);
    delay(10);
}

static void uart_putc(char c)
{
    while ((USART3_ISR & (1u << 7)) == 0) { }  /* Wait for TXE */
    USART3_TDR = (uint32_t)c;
}

static void uart_puts(const char *s)
{
    while (*s) {
        if (*s == '\n') uart_putc('\r');
        uart_putc(*s++);
    }
}

