wolfSSL/wolfip/src/port/stm32h753/main.c
static void uart_puthex(uint32_t val)
{
    const char hex[] = "0123456789ABCDEF";
    uart_puts("0x");
    for (int i = 28; i >= 0; i -= 4) {
        uart_putc(hex[(val >> i) & 0xF]);
    }
}

static void uart_putdec(uint32_t val)
{
    char buf[12];
    int i = 0;
    if (val == 0) {
        uart_putc('0');
        return;
    }
    while (val > 0 && i < 11) {
        buf[i++] = '0' + (val % 10);
        val /= 10;
    }
    while (i > 0) {
        uart_putc(buf[--i]);
    }
}

static void uart_putip4(ip4 ip)
{
    uart_putdec((ip >> 24) & 0xFF);
    uart_putc('.');
    uart_putdec((ip >> 16) & 0xFF);
    uart_putc('.');
    uart_putdec((ip >> 8) & 0xFF);
    uart_putc('.');
    uart_putdec(ip & 0xFF);
}

/* =========================================================================
 * Ethernet GPIO Configuration for NUCLEO-H753ZI
 * ========================================================================= */

/* Configure a GPIO pin for Ethernet alternate function (AF11) */
static void gpio_eth_pin(uint32_t base, uint32_t pin)
{
    uint32_t moder, ospeedr, afr;
    uint32_t pos2 = pin * 2u;

    /* Set mode to alternate function (0b10) */
    moder = GPIO_MODER(base);
    moder &= ~(3u << pos2);
    moder |= (2u << pos2);
    GPIO_MODER(base) = moder;

    /* Set high speed */
    ospeedr = GPIO_OSPEEDR(base);
    ospeedr |= (3u << pos2);
    GPIO_OSPEEDR(base) = ospeedr;

    /* Set AF11 for Ethernet */
    if (pin < 8u) {
        afr = GPIO_AFRL(base);
        afr &= ~(0xFu << (pin * 4u));
        afr |= (11u << (pin * 4u));
        GPIO_AFRL(base) = afr;
    } else {
        afr = GPIO_AFRH(base);
        afr &= ~(0xFu << ((pin - 8u) * 4u));
        afr |= (11u << ((pin - 8u) * 4u));
        GPIO_AFRH(base) = afr;
    }
}

/* Initialize GPIO pins for RMII Ethernet (NUCLEO-H753ZI pinout) */
static void eth_gpio_init(void)
{
    uint32_t val;

    /* Enable GPIO clocks: A, B, C, G */
    RCC_AHB4ENR |= (1u << 0) | (1u << 1) | (1u << 2) | (1u << 6);

    /* Enable SYSCFG clock for RMII selection */
    RCC_APB4ENR |= (1u << 1);

    delay(1000);

    /* Set RMII mode in SYSCFG_PMCR and close analog switches.
     * STM32H7 PA0/PA1/PC2/PC3 have analog switches that default to OPEN,
     * which disconnects the digital AF path. PA1 is ETH_REF_CLK - the MAC
     * requires this 50MHz clock to function (registers read 0 without it).
     * Also enable the I/O booster for high-speed Ethernet signals. */
    val = SYSCFG_PMCR;
    val &= ~((0x7u << 21) |         /* Clear EPIS bits */
             (1u << 24) |            /* Close PA0 analog switch */
             (1u << 25) |            /* Close PA1 analog switch (ETH_REF_CLK!) */
             (1u << 26) |            /* Close PC2 analog switch */
             (1u << 27));            /* Close PC3 analog switch */
    val |= SYSCFG_PMCR_EPIS_RMII |  /* Set RMII mode */
           (1u << 8);               /* BOOSTE: enable I/O booster */
    SYSCFG_PMCR = val;

    /* Critical: dummy read forces APB4 write to complete before ETH
     * clock enable (STM32CubeH7 Issue #121). Without this, the RMII
     * mux may not be selected when the MAC first sees its clocks. */
    (void)SYSCFG_PMCR;
    __asm volatile ("dsb sy" ::: "memory");

    delay(1000);

    /* Configure RMII pins for NUCLEO-H753ZI:
     * PA1  - ETH_REF_CLK (AF11)
     * PA2  - ETH_MDIO (AF11)
     * PA7  - ETH_CRS_DV (AF11)
     * PC1  - ETH_MDC (AF11)
     * PC4  - ETH_RXD0 (AF11)
     * PC5  - ETH_RXD1 (AF11)
     * PB13 - ETH_TXD1 (AF11)  <-- Note: Different from H563!
     * PG11 - ETH_TX_EN (AF11)
     * PG13 - ETH_TXD0 (AF11)
     */
    gpio_eth_pin(GPIOA_BASE, 1);   /* REF_CLK */
    gpio_eth_pin(GPIOA_BASE, 2);   /* MDIO */
    gpio_eth_pin(GPIOA_BASE, 7);   /* CRS_DV */
    gpio_eth_pin(GPIOC_BASE, 1);   /* MDC */
    gpio_eth_pin(GPIOC_BASE, 4);   /* RXD0 */
    gpio_eth_pin(GPIOC_BASE, 5);   /* RXD1 */
    gpio_eth_pin(GPIOB_BASE, 13);  /* TXD1 */
    gpio_eth_pin(GPIOG_BASE, 11);  /* TX_EN */
    gpio_eth_pin(GPIOG_BASE, 13);  /* TXD0 */
}

/* =========================================================================
 * TLS Client Callback
 * ========================================================================= */

#ifdef ENABLE_TLS
static void tls_response_cb(const char *data, int len, void *ctx)
{
    (void)ctx;
    uart_puts("TLS Client received ");
    uart_putdec((uint32_t)len);
    uart_puts(" bytes:\n");

    /* Print first 200 chars of response */
    for (int i = 0; i < len && i < 200; i++) {
        uart_putc(data[i]);
    }
    if (len > 200) {
        uart_puts("\n... (truncated)\n");
    }
    uart_puts("\n");
    tls_client_test_done = 1;
}
#endif

/* =========================================================================
 * TCP Echo Server Callback
 * ========================================================================= */

static void echo_cb(int fd, uint16_t event, void *arg)
{
    struct wolfIP *s = (struct wolfIP *)arg;
    int ret;

    if ((fd == listen_fd) && (event & CB_EVENT_READABLE) && (client_fd == -1)) {
        client_fd = wolfIP_sock_accept(s, listen_fd, NULL, NULL);
        if (client_fd > 0) {
            wolfIP_register_callback(s, client_fd, echo_cb, s);
            led_blue_on();  /* Client connected */
        }
        return;
    }

    if ((fd == client_fd) && (event & CB_EVENT_READABLE)) {
        ret = wolfIP_sock_recvfrom(s, client_fd, rx_buf, sizeof(rx_buf), 0, NULL, NULL);
        if (ret > 0) {
            (void)wolfIP_sock_sendto(s, client_fd, rx_buf, (uint32_t)ret, 0, NULL, 0);
        } else if (ret == 0) {
            wolfIP_sock_close(s, client_fd);
            client_fd = -1;
            led_blue_off();
        }
    }

    if ((fd == client_fd) && (event & CB_EVENT_CLOSED)) {
        wolfIP_sock_close(s, client_fd);
        client_fd = -1;
        led_blue_off();
    }
}

/* =========================================================================
 * Main
 * ========================================================================= */

int main(void)
{
    struct wolfIP_ll_dev *ll;
    struct wolfIP_sockaddr_in addr;
    uint64_t tick = 0;
    int ret;

