wolfSSL/wolfip/src/port/stm32h753/main.c
    /* Initialize LEDs first - Green ON to show code is running */
    led_init();
    led_green_on();

    /* Early UART init at 64MHz HSI for debugging */
    uart_init_early();
    uart_puts("\n\n=== Clock Config Debug ===\n");
    uart_puts("Running at 64MHz HSI...\n");
    uart_puts("Configuring HSE + PLL (400MHz)...\n");

    /* Configure system clock: HSE + PLL -> 400MHz SYSCLK, 200MHz HCLK */
    ret = system_clock_config();
    if (ret != 0) {
        /* Clock config failed - print error and blink red LED */
        uart_puts("CLOCK CONFIG FAILED! Error: ");
        uart_puthex((uint32_t)ret);
        uart_puts("\n");
        led_red_on();
        while (1) {
            led_red_on();
            delay(500000);
            led_red_off();
            delay(500000);
        }
    }

    /* Reconfigure UART for 100MHz APB1 */
    uart_reconfigure();
    uart_puts("Clock config OK! Now at 400MHz SYSCLK, 200MHz HCLK\n");

    led_green_on();
    led_blue_off();
    led_red_off();

    /* Initialize hardware RNG */
    rng_init();
    {
        uint32_t rng_test;
        int rng_ok = rng_get_word(&rng_test);
        uart_puts("RNG init: ");
        uart_puts(rng_ok == 0 ? "OK" : "FAILED");
        if (rng_ok == 0) {
            uart_puts(" val="); uart_puthex(rng_test);
        }
        uart_puts("\n");
    }

#ifdef ENABLE_TLS
#ifdef DEBUG_HW
    /* Direct bare-metal HASH test - bypass wolfSSL entirely */
    uart_puts("\n--- Direct HASH Hardware Test ---\n");
    {
        volatile uint32_t *hash_cr  = (volatile uint32_t *)0x48021400UL;
        volatile uint32_t *hash_str = (volatile uint32_t *)0x48021408UL;
        volatile uint32_t *hash_hr  = (volatile uint32_t *)0x4802140CUL;
        volatile uint32_t *hash_sr  = (volatile uint32_t *)0x48021424UL;
        uint32_t timeout;
        int algo_idx;

        /* Enable HASH clock (AHB2 bit 5) */
        RCC_AHB2ENR |= (1u << 5);
        (void)RCC_AHB2ENR;
        for (volatile int d = 0; d < 1000; d++) {}

        /* Test hash of empty message with all 4 ALGO settings.
         * Expected digests (first word, big-endian in HR[0]):
         *   MD5("")    = d41d8cd9... → HR[0]=0xd98c1dd4
         *   SHA-1("")  = da39a3ee... → HR[0]=0xeea339da
         *   SHA-224("") = d14a028c... → HR[0]=0x8c024ad1 (if supported)
         *   SHA-256("") = e3b0c442... → HR[0]=0x42c4b0e3
         */
        struct { uint32_t bits; const char *name; } algos[4] = {
            { 0x00000000, "MD5    (ALGO=00)" },
            { 0x00000080, "SHA-1  (ALGO=01)" },
            { 0x00040000, "SHA-224(ALGO=10)" },
            { 0x00040080, "SHA-256(ALGO=11)" },
        };

        for (algo_idx = 0; algo_idx < 4; algo_idx++) {
            uart_puts("  ");
            uart_puts(algos[algo_idx].name);
            uart_puts(": CR=");

            /* Configure and init: algo + DATATYPE_8B + INIT */
            *hash_cr = algos[algo_idx].bits | 0x20 | 0x04;
            uart_puthex(*hash_cr);

            /* Set NBLW=0 (all bits valid) and trigger DCAL */
            *hash_str = 0;
            *hash_str = (1u << 8);  /* DCAL */

            /* Wait for digest complete */
            timeout = 100000;
            while ((*hash_sr & (1u << 1)) == 0 && --timeout) {}

            uart_puts(" HR0=");
            uart_puthex(hash_hr[0]);
            uart_puts(" HR1=");
            uart_puthex(hash_hr[1]);
            uart_puts(timeout == 0 ? " TIMEOUT" : " OK");
            uart_puts("\n");
        }

        /* Keep HASH clock enabled */
    }
#endif /* DEBUG_HW */

#ifdef DEBUG_HW
    /* Run wolfCrypt test to validate all crypto algorithms.
     * This confirms hardware HASH/HMAC is working correctly. */
    uart_puts("\n--- Running wolfCrypt Test ---\n");
    {
        typedef struct func_args {
            int    argc;
            char** argv;
            int    return_code;
        } func_args;
        func_args args;
        args.argc = 0;
        args.argv = NULL;
        args.return_code = 0;

        wolfCrypt_Init();
        wolfcrypt_test(&args);

        uart_puts("wolfCrypt Test: Return code ");
        if (args.return_code < 0) {
            uart_puts("-");
            uart_putdec((uint32_t)(-args.return_code));
        } else {
            uart_putdec((uint32_t)args.return_code);
        }
        uart_puts(args.return_code == 0 ? " (PASSED)\n" : " (FAILED)\n");
        wolfCrypt_Cleanup();

        if (args.return_code != 0) {
            uart_puts("ERROR: wolfCrypt test failed! Halting.\n");
            led_red_on();
            while (1) { }
        }
    }
#else
    wolfCrypt_Init();
#endif /* DEBUG_HW */
#endif /* ENABLE_TLS */

    uart_puts("\n\n=== wolfIP STM32H753ZI Echo Server ===\n");

#ifdef DEBUG_HW
    /* Read chip revision - critical for errata */
    uart_puts("Chip ID:\n");
    {
        volatile uint32_t *dbgmcu_idc = (volatile uint32_t *)(0x5C001000UL);
        uint32_t idc = *dbgmcu_idc;
        uart_puts("  DBGMCU_IDCODE: "); uart_puthex(idc); uart_puts("\n");
        uart_puts("  DEV_ID: "); uart_puthex(idc & 0xFFF);
        uart_puts(" REV_ID: "); uart_puthex((idc >> 16) & 0xFFFF);
        uart_puts("\n");
    }

    /* Dump clock prescaler config */
    uart_puts("Clock prescalers:\n");
    uart_puts("  RCC_D1CFGR: "); uart_puthex(*(volatile uint32_t *)(RCC_BASE + 0x18));
    uart_puts("\n");
    uart_puts("  RCC_D2CFGR: "); uart_puthex(*(volatile uint32_t *)(RCC_BASE + 0x1C));
    uart_puts("\n");
    uart_puts("  RCC_D3CFGR: "); uart_puthex(*(volatile uint32_t *)(RCC_BASE + 0x20));
    uart_puts("\n");
#endif

    uart_puts("Initializing wolfIP stack...\n");
    wolfIP_init_static(&IPStack);

    /* ================================================================
     * ETH Init: GPIO/SYSCFG first, then wait for PHY, then clocks.
     *
     * The LAN8742A PHY needs up to 167ms after hardware reset (which
     * is tied to NRST on the Nucleo board) to start outputting a
     * stable 50MHz REF_CLK. We must wait for this before enabling
     * the ETH MAC clocks, since the MAC's register interface won't
     * respond without a valid reference clock.
     *
     * Also enable the SYSCFG I/O compensation cell (required for
     * BOOSTE to take effect per RM0433).
     * ================================================================ */

