wolfSSL/wolfip/src/port/stm32h753/main.c
    /* Step 1: Configure GPIO + SYSCFG RMII mode */
    eth_gpio_init();

#ifdef DEBUG_HW
    /* Verify GPIO config IMMEDIATELY after eth_gpio_init() */
    uart_puts("GPIO verification (after eth_gpio_init):\n");
    {
        uint32_t moder_a = GPIO_MODER(GPIOA_BASE);
        uint32_t afrl_a  = GPIO_AFRL(GPIOA_BASE);
        uint32_t moder_c = GPIO_MODER(GPIOC_BASE);
        uint32_t afrl_c  = GPIO_AFRL(GPIOC_BASE);
        uint32_t moder_g = GPIO_MODER(GPIOG_BASE);
        uint32_t afrh_g  = GPIO_AFRH(GPIOG_BASE);
        uint32_t moder_b = GPIO_MODER(GPIOB_BASE);
        uint32_t afrh_b  = GPIO_AFRH(GPIOB_BASE);
        uint32_t pmcr    = SYSCFG_PMCR;

        uart_puts("  GPIOA MODER: "); uart_puthex(moder_a);
        uart_puts("  AFRL: "); uart_puthex(afrl_a); uart_puts("\n");
        /* PA1: MODER[3:2]=10(AF), AFRL[7:4]=0xB(AF11) */
        uart_puts("    PA1 mode="); uart_puthex((moder_a >> 2) & 3);
        uart_puts(" af="); uart_puthex((afrl_a >> 4) & 0xF);
        uart_puts((((moder_a >> 2) & 3) == 2 && ((afrl_a >> 4) & 0xF) == 11) ?
                  " OK\n" : " WRONG!\n");
        /* PA2: MODER[5:4]=10, AFRL[11:8]=0xB */
        uart_puts("    PA2 mode="); uart_puthex((moder_a >> 4) & 3);
        uart_puts(" af="); uart_puthex((afrl_a >> 8) & 0xF);
        uart_puts((((moder_a >> 4) & 3) == 2 && ((afrl_a >> 8) & 0xF) == 11) ?
                  " OK\n" : " WRONG!\n");
        /* PA7: MODER[15:14]=10, AFRL[31:28]=0xB */
        uart_puts("    PA7 mode="); uart_puthex((moder_a >> 14) & 3);
        uart_puts(" af="); uart_puthex((afrl_a >> 28) & 0xF);
        uart_puts((((moder_a >> 14) & 3) == 2 && ((afrl_a >> 28) & 0xF) == 11) ?
                  " OK\n" : " WRONG!\n");

        uart_puts("  GPIOC MODER: "); uart_puthex(moder_c);
        uart_puts("  AFRL: "); uart_puthex(afrl_c); uart_puts("\n");
        /* PC1: MODER[3:2]=10, AFRL[7:4]=0xB */
        uart_puts("    PC1 mode="); uart_puthex((moder_c >> 2) & 3);
        uart_puts(" af="); uart_puthex((afrl_c >> 4) & 0xF);
        uart_puts((((moder_c >> 2) & 3) == 2 && ((afrl_c >> 4) & 0xF) == 11) ?
                  " OK\n" : " WRONG!\n");

        uart_puts("  GPIOB MODER: "); uart_puthex(moder_b);
        uart_puts("  AFRH: "); uart_puthex(afrh_b); uart_puts("\n");
        /* PB13: MODER[27:26]=10, AFRH[23:20]=0xB */
        uart_puts("    PB13 mode="); uart_puthex((moder_b >> 26) & 3);
        uart_puts(" af="); uart_puthex((afrh_b >> 20) & 0xF);
        uart_puts((((moder_b >> 26) & 3) == 2 && ((afrh_b >> 20) & 0xF) == 11) ?
                  " OK\n" : " WRONG!\n");

        uart_puts("  GPIOG MODER: "); uart_puthex(moder_g);
        uart_puts("  AFRH: "); uart_puthex(afrh_g); uart_puts("\n");
        /* PG11: MODER[23:22]=10, AFRH[15:12]=0xB */
        uart_puts("    PG11 mode="); uart_puthex((moder_g >> 22) & 3);
        uart_puts(" af="); uart_puthex((afrh_g >> 12) & 0xF);
        uart_puts((((moder_g >> 22) & 3) == 2 && ((afrh_g >> 12) & 0xF) == 11) ?
                  " OK\n" : " WRONG!\n");
        /* PG13: MODER[27:26]=10, AFRH[23:20]=0xB */
        uart_puts("    PG13 mode="); uart_puthex((moder_g >> 26) & 3);
        uart_puts(" af="); uart_puthex((afrh_g >> 20) & 0xF);
        uart_puts((((moder_g >> 26) & 3) == 2 && ((afrh_g >> 20) & 0xF) == 11) ?
                  " OK\n" : " WRONG!\n");

        uart_puts("  SYSCFG_PMCR: "); uart_puthex(pmcr);
        uart_puts(" EPIS="); uart_puthex((pmcr >> 21) & 7);
        uart_puts((((pmcr >> 21) & 7) == 4) ? " (RMII OK)" : " (WRONG!)");
        uart_puts(" switches="); uart_puthex((pmcr >> 24) & 0xF);
        uart_puts((((pmcr >> 24) & 0xF) == 0) ? " (closed OK)\n" : " (OPEN!)\n");
    }
#endif

    /* Step 2: Wait for PHY REF_CLK to stabilize after board reset.
     * LAN8742A power-on reset takes up to 167ms. We wait ~200ms to
     * be safe. The MAC needs REF_CLK for register access.
     * Calibration: volatile loop ~80ns/iter at 400MHz (12500 iters/ms) */
    delay(2500000);  /* ~200ms */
#ifdef DEBUG_HW
    {
        uint32_t pa1_samples = 0;
        int i;
        for (i = 0; i < 32; i++) {
            if (GPIO_IDR(GPIOA_BASE) & (1u << 1))
                pa1_samples |= (1u << i);
        }
        uart_puts("  PA1 (REF_CLK): "); uart_puthex(pa1_samples);
        uart_puts(pa1_samples == 0 ? " (ALL LOW!)\n" :
                   pa1_samples == 0xFFFFFFFF ? " (ALL HIGH!)\n" :
                   " (toggling OK)\n");
    }
#endif

    /* Step 3: Enable ETH clocks.
     * CRITICAL: ETH clock bits are 15,16,17 in AHB1ENR (NOT 25,26,27!)
     *   Bit 15: ETH1MACEN  (bus interface clock)
     *   Bit 16: ETH1TXEN   (TX clock, from REF_CLK in RMII)
     *   Bit 17: ETH1RXEN   (RX clock, from REF_CLK in RMII)
     * Bits 25-27 are USB OTG clocks - not ETH! */
    RCC_AHB1ENR |= (1u << 15) | (1u << 16) | (1u << 17);
    __asm volatile ("dsb sy" ::: "memory");
    delay(12500);  /* ~1ms for clocks to stabilize */

    /* Step 4: RCC reset ETH MAC (bit 15 in AHB1RSTR) */
    RCC_AHB1RSTR |= RCC_AHB1RSTR_ETHRST;
    __asm volatile ("dsb sy" ::: "memory");
    delay(12500);  /* ~1ms reset pulse */
    RCC_AHB1RSTR &= ~RCC_AHB1RSTR_ETHRST;
    __asm volatile ("dsb sy" ::: "memory");
    delay(125000);  /* ~10ms post-reset stabilization */

    uart_puts("Initializing Ethernet MAC...\n");
    ll = wolfIP_getdev(IPStack);
    ret = stm32_eth_init(ll, NULL);
    if (ret < 0) {
        uart_puts("  ERROR: stm32_eth_init failed (");
        uart_puthex((uint32_t)ret);
        uart_puts(")\n");
        led_red_on();
    } else {
        uart_puts("  PHY link: ");
        uart_puts((ret & 0x100) ? "UP" : "DOWN");
        uart_puts(", PHY addr: ");
        uart_puthex(ret & 0xFF);
        uart_puts("\n");
    }

#ifdef DEBUG_HW
    /* Debug: Read MDIO registers post-init */
    uart_puts("MDIO Debug (post-init register state):\n");
    {
        volatile uint32_t *macmdioar = (volatile uint32_t *)(0x40028000UL + 0x0200U);
        volatile uint32_t *macmdiodr = (volatile uint32_t *)(0x40028000UL + 0x0204U);
        volatile uint32_t *maccr     = (volatile uint32_t *)(0x40028000UL + 0x0000U);
        volatile uint32_t *dmamr     = (volatile uint32_t *)(0x40028000UL + 0x1000U);
        uint32_t cfg, timeout;

        uart_puts("  MACCR:     "); uart_puthex(*maccr); uart_puts("\n");
        uart_puts("  DMAMR:     "); uart_puthex(*dmamr); uart_puts("\n");
        uart_puts("  MACMDIOAR: "); uart_puthex(*macmdioar); uart_puts("\n");
        uart_puts("  MACMDIODR: "); uart_puthex(*macmdiodr); uart_puts("\n");
        uart_puts("  RCC_AHB1ENR: "); uart_puthex(RCC_AHB1ENR); uart_puts("\n");
        uart_puts("  RCC_AHB2ENR: "); uart_puthex(RCC_AHB2ENR); uart_puts("\n");
        uart_puts("  SYSCFG_PMCR: "); uart_puthex(SYSCFG_PMCR); uart_puts("\n");

