wolfSSL/wolfip/src/port/stm32h753/main.c
        /* Try MDIO read of PHY ID1 (reg 2) at address 0 */
        timeout = 100000;
        while ((*macmdioar & 1) && --timeout) {}
        uart_puts("  MB clear wait timeout_left="); uart_putdec(timeout); uart_puts("\n");

        cfg = (4U << 8) |     /* CR=4 for HCLK/102 (200MHz HCLK) */
              (2U << 16) |    /* RDA=2 (PHY_REG_ID1) */
              (0U << 21) |    /* PA=0 (PHY addr 0) */
              (3U << 2);      /* GOC=3 (read) */
        *macmdioar = cfg | 1; /* Set MB bit */
        uart_puts("  MACMDIOAR wrote: "); uart_puthex(cfg | 1);
        uart_puts(" readback: "); uart_puthex(*macmdioar); uart_puts("\n");

        timeout = 100000;
        while ((*macmdioar & 1) && --timeout) {}
        uart_puts("  MDIO op done, timeout_left="); uart_putdec(timeout); uart_puts("\n");
        uart_puts("  MACMDIOAR: "); uart_puthex(*macmdioar); uart_puts("\n");
        uart_puts("  MACMDIODR (ID1@0): "); uart_puthex(*macmdiodr); uart_puts("\n");

        /* Try PHY address 1 */
        timeout = 100000;
        while ((*macmdioar & 1) && --timeout) {}
        cfg = (4U << 8) | (2U << 16) | (1U << 21) | (3U << 2);
        *macmdioar = cfg | 1;
        timeout = 100000;
        while ((*macmdioar & 1) && --timeout) {}
        uart_puts("  MACMDIODR (ID1@1): "); uart_puthex(*macmdiodr); uart_puts("\n");
    }
#endif

#ifdef DHCP
    {
        uint32_t dhcp_start_tick;
        uint32_t dhcp_timeout = 30000;

        ret = dhcp_client_init(IPStack);
        if (ret >= 0) {
            uart_puts("Waiting for DHCP...\n");
            dhcp_start_tick = tick;
            while (!dhcp_bound(IPStack)) {
                uint32_t elapsed = (uint32_t)(tick - dhcp_start_tick);
                (void)wolfIP_poll(IPStack, tick);
                tick++;
#ifdef DEBUG_HW
                if ((elapsed < 10) ||
                    (elapsed % 2000) == 0) {
                    uint32_t polls, pkts;
                    stm32_eth_get_stats(&polls, &pkts);
                    uart_puts("  tick=");
                    uart_putdec(elapsed);
                    uart_puts(" rx_polls=");
                    uart_putdec(polls);
                    uart_puts(" rx_pkts=");
                    uart_putdec(pkts);
                    uart_puts(" DMACSR=");
                    uart_puthex(stm32_eth_get_dmacsr());
                    uart_puts(" des3=");
                    uart_puthex(stm32_eth_get_rx_des3());
                    uart_puts("\n");
                }
#endif
                delay(100000);  /* ~8ms per poll */
                if (elapsed > dhcp_timeout)
                    break;
            }
            if (dhcp_bound(IPStack)) {
                ip4 ip = 0, nm = 0, gw = 0;
                wolfIP_ipconfig_get(IPStack, &ip, &nm, &gw);
                uart_puts("DHCP configuration received:\n");
                uart_puts("  IP: ");
                uart_putip4(ip);
                uart_puts("\n  Mask: ");
                uart_putip4(nm);
                uart_puts("\n  GW: ");
                uart_putip4(gw);
                uart_puts("\n");
            } else {
                uart_puts("DHCP timeout!\n");
            }
        }
    }
#else
    {
        ip4 ip = atoip4(WOLFIP_IP);
        ip4 nm = atoip4(WOLFIP_NETMASK);
        ip4 gw = atoip4(WOLFIP_GW);
        uart_puts("Using static IP configuration:\n");
        uart_puts("  IP: ");
        uart_putip4(ip);
        uart_puts("\n  Mask: ");
        uart_putip4(nm);
        uart_puts("\n  GW: ");
        uart_putip4(gw);
        uart_puts("\n");
        wolfIP_ipconfig_set(IPStack, ip, nm, gw);
    }
#endif

    /* Create TCP echo server on port 7 */
    uart_puts("Creating TCP echo server on port 7...\n");
    listen_fd = wolfIP_sock_socket(IPStack, AF_INET, IPSTACK_SOCK_STREAM, 0);
    wolfIP_register_callback(IPStack, listen_fd, echo_cb, IPStack);

    memset(&addr, 0, sizeof(addr));
    addr.sin_family = AF_INET;
    addr.sin_port = ee16(ECHO_PORT);
    addr.sin_addr.s_addr = 0;
    (void)wolfIP_sock_bind(IPStack, listen_fd, (struct wolfIP_sockaddr *)&addr, sizeof(addr));
    (void)wolfIP_sock_listen(IPStack, listen_fd, 1);

#ifdef ENABLE_TLS
    uart_puts("Initializing TLS client...\n");
    if (tls_client_init(IPStack, uart_puts) < 0) {
        uart_puts("ERROR: TLS client init failed\n");
        led_red_on();
    }
    tls_client_set_sni(GOOGLE_HOST);
#endif

    uart_puts("Entering main loop. Ready for connections!\n");
    uart_puts("  TCP Echo: port 7\n");
#ifdef ENABLE_TLS
    uart_puts("  TLS Client: will connect to Google after ~2s\n");
#endif

    for (;;) {
        (void)wolfIP_poll(IPStack, tick++);
        delay(100000);  /* ~8ms per tick (volatile loop ~80ns/iter at 400MHz) */

#ifdef ENABLE_TLS
        /* TLS client test: connect to Google after network settles */
        if (!tls_client_test_started && tick > 250) {
            uart_puts("\n--- TLS Client Test: Connecting to Google ---\n");
            uart_puts("Target: ");
            uart_puts(GOOGLE_IP);
            uart_puts(":");
            uart_putdec(GOOGLE_HTTPS_PORT);
            uart_puts("\n");

            if (tls_client_connect(GOOGLE_IP, GOOGLE_HTTPS_PORT, tls_response_cb, NULL) == 0) {
                uart_puts("TLS Client: Connection initiated\n");
            } else {
                uart_puts("TLS Client: Failed to start connection\n");
            }
            tls_client_test_started = 1;
        }

        /* Poll TLS client state machine */
        tls_client_poll();

        /* Send HTTP request once TLS handshake completes */
        if (tls_client_is_connected() && !tls_client_test_done) {
            static int request_sent = 0;
            if (!request_sent) {
                const char *http_req = "GET / HTTP/1.1\r\n"
                                       "Host: " GOOGLE_HOST "\r\n"
                                       "Connection: close\r\n\r\n";
                uart_puts("TLS Client: Sending HTTP GET request...\n");
                if (tls_client_send(http_req, (int)strlen(http_req)) > 0) {
                    uart_puts("TLS Client: Request sent\n");
                } else {
                    uart_puts("TLS Client: Send failed\n");
                }
                request_sent = 1;
            }
        }
#endif

        /* Toggle green LED every ~256K iterations as heartbeat */
        if ((tick & 0x3FFFF) == 0) {
            led_toggle_green();
        }
    }

    return 0;
}
